benchmark/results/create-donation-c16-d10s.txt
Running 10s test @ http://localhost:5000
  8 threads and 16 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   577.86ms   82.57ms   1.14s    88.15%
    Req/Sec     4.66      3.30    10.00     67.01%
  Latency Distribution
     50%  579.46ms
     75%  603.98ms
     90%  653.90ms
     99%  706.19ms
  270 requests in 10.01s, 86.48KB read
Requests/sec:     26.98
Transfer/sec:      8.64KB