benchmark/results/create-donation-c32-d10s.txt
Running 10s test @ http://localhost:5000
  8 threads and 32 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.16s   222.39ms   1.43s    90.42%
    Req/Sec     8.39      8.64    30.00     75.86%
  Latency Distribution
     50%    1.19s 
     75%    1.28s 
     90%    1.32s 
     99%    1.37s 
  261 requests in 10.10s, 83.60KB read
Requests/sec:     25.85
Transfer/sec:      8.28KB